---
layout: post
title: "Android Develop Record - Margin and Padding"
description: "Android Develop Record"
category: "Programming"
tags: ["Android"]
---

{% include JB/setup %}

![Profile](http://www.w3schools.com/css/box-model.gif)

做了顿晚饭，跟小汲聊了好久，上海这两天水深火热吧，高温，暴雨，挺怀念的。

又看了一遍Social Networks，每次看完心中都会有想写代码的冲动。 
    
09年刚进学校，JBoss的一句少用qq至今铭记在心，而到现在我才深有同感，时间不是自己走的，而是我浪费掉的。

11年暑假，我刚刚开始做android开发时，利文浩大神的一句嵌套相对布局点醒了我，而一年之后我才真正体会到原来所有的布局都可以这么弄。如今，两年过去了，这句话依然受用。

11年某月，软件测试的一门作业，李垚大神对我的修改的代码评价了四个字，“简单粗暴”，让我明白在没有搞懂别人的代码前一定要尊重别人的代码。时至今日，我觉得我仍然没有彻底参透这句话的内涵。

11年某月，Unix编程的一节课，叶家彬大神的一句“坚决不用盗版，拥护开源社区”，两年后的现在我才真正深有体会，作为劳动者，一样要尊重别人的劳动成果。 

12年六月，人机交互课的大作业，利文浩大神极力推荐我Github，直到今天我才开始慢慢体会到Github的博大精深，作为一个码农，没有代码托管真不行。Github更像是程序员们的SNS。

跟大神交流，总是能获得进步。很多时候，我需要花一年两年才能理解他们的话并产生共鸣。

    不要做一个简单的码农，要做一个会思考的码农，这样才有进步。



